Repo/ph_mediated_sample_stacking/phMSS_b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       3999;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       7999;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       11999;
    }
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       15999;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       16000;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       16001;
    }
)

// ************************************************************************* //
