Repo/ph_mediated_sample_stacking/phMSS_b/constant/electrolytes.txt
7 0.05 0.85 0 0
FORMIC_ACID  1000.0 0.0 1000.0          
ACETIC_ACID 0.0 200.0 0.0
AMMONIUM    0.0 200.0 0.0
LYSINE       0.0 0.02 0.0
ALANINE    0.0 0.02  0.0
GLUTAMIC_ACID   0.0 0.02 0.0
TRYPTOPHANE      0.0 0.02 0.0
k1 0 0 1 2 3
A                 3.33e-7 0. 0. 
T                 -1 -1 -1  1.323e-6 0.0267 4e-4         
AT                0.0 0.0 0.0           
k1 1.21831 1.75e-3 4 5 6
