Repo/ph_mediated_sample_stacking/phMSS_b/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
1.57618428e-05
4.7309167e-05
7.8903804e-05
0.000110545825
0.0001422353
0.000173972301
0.0002057569
0.000237589167
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
1.57618428e-05
4.7309167e-05
7.8903804e-05
0.000110545825
0.0001422353
0.000173972302
0.0002057569
0.000237589167
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.8;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
